alerntrk/Drivers_STM32L053R8-/Inc/stm32l053Rx.h
/*
 * stm32l0xx.h
 *
 *  Created on: 13 Tem 2021
 *      Author: ALIEREN TURK
 */

#ifndef STM32L0XX_H_
#define STM32L0XX_H_
#include <stdint.h>
#define UNUSED(X)					(void)X
#define __IO 	volatile
#define SET_BIT(REG,BIT)			((REG)|=(BIT))
#define CLEAR_BIT(REG,BIT)			((REG)&=~(BIT))
#define READ_PIN(REG,BIT)			((REG)&(BIT))

#define HSI_VALUE    ((uint32_t)16000000U) 	/*!< Value of the Internal oscillator in Hz*/
#define HSE_VALUE    ((uint32_t)8000000U) 	/*!< Value of the External oscillator in Hz */
#define LSE_VALUE    ((uint32_t)32768U) 	/*!< Value of the External oscillator in Hz*/



typedef enum{
	DISABLE = 0x0,
	ENABLE= !DISABLE
}FunctionalState_t;
/*
 * IRQ numbers of MCU = vector table
 *
 */
typedef enum{
	EXTI_0_1_IRQ=5,
	EXTI_2_3_IRQ=6,
	EXTI_4_15_IRQ=7,
	SPI1_IRQ=25,
	USART2_IRQn=28
}IRQ_Number_Typedef_t;
/*
 * Memory base address
 *
 */
#define FLASH_BASE_ADDR				(0x08000000UL) 	//flash base address
#define SRAM1_BASE_ADDR				(0x20000000UL)	//sram address 8kb
/*
 * peripheral base addresses
 */

#define PERIPH_BASE_ADDR			(0x40000000UL)  				//all peripherals base address
#define APB1_BASE_ADDR				PERIPH_BASE_ADDR  				// APB1 bus domain base address
#define APB2_BASE_ADDR				(PERIPH_BASE_ADDR+0x10000UL) 	//APB2 bus domain base address
#define AHB_BASE_ADDR				(PERIPH_BASE_ADDR+0x20000UL)  	//AHB bus domain base address
#define IOPORT_BASE_ADDR			(PERIPH_BASE_ADDR+0x10000000UL)	//IOPORT bus domain base address

/*
 * APB1 peripherals base addresses
 */
#define TIM2_BASE_ADDR				APB1_BASE_ADDR     				//Timer2 base address
#define TIM3_BASE_ADDR				(APB1_BASE_ADDR+0x400UL)		//Timer3 base address
#define TIM6_BASE_ADDR				(APB1_BASE_ADDR+0x1000UL)		//Timer6 base address
#define SPI2_BASE_ADDR				(APB1_BASE_ADDR+0x3800UL)		//SPI2 base address
#define USART2_BASE_ADDR			(APB1_BASE_ADDR+0x4400UL)		//USART2 base address
#define USART4_BASE_ADDR			(APB1_BASE_ADDR+0x4C00UL)		//USART4 base address
#define LPUART_BASE_ADDR			(APB1_BASE_ADDR+0x4800UL)		//LPUART base address

#define I2C1_BASE_ADDR				(APB1_BASE_ADDR+0x5400UL)		//I2C1 base address
#define I2C2_BASE_ADDR				(APB1_BASE_ADDR+0x5800UL)		//I2C2 base address

/*
 * APB2 peripherals base addresses
 */
#define SYSCFG_BASE_ADDR					APB2_BASE_ADDR					// System config base adddres
#define COMP1_BASE_ADDR						(APB2_BASE_ADDR	+ 0x18)			//COMPARATOR 1 base address
#define EXTI_BASE_ADDR						(APB2_BASE_ADDR	+ 0x400)		//EXTI base address
#define TIM21_BASE_ADDR						(APB2_BASE_ADDR	+ 0x800)		//Timer21 base address
#define FIRWLL_BASE_ADDR					(APB2_BASE_ADDR	+ 0x1C00)		//FIREWALL base address
#define ADC1_BASE_ADDR						(APB2_BASE_ADDR	+ 0x2400)		//ADC1 base address
#define SPI1_BASE_ADDR						(APB2_BASE_ADDR	+ 0x3000)		//SPI1 base address
#define USART1_BASE_ADDR					(APB2_BASE_ADDR	+ 0x3800)		//USART1 base address
/*
 * AHB peripherals base addresses
 */
#define RCC_BASE_ADDR						(AHB_BASE_ADDR + 0x1000)			//RCC base address


/*
 *IOPORT peripherals base addresses
 */
#define GPIOA_BASE_ADDR						(IOPORT_BASE_ADDR)				//GPIOA base address
#define GPIOB_BASE_ADDR						(IOPORT_BASE_ADDR+0x400)		//GPIOB base address
#define GPIOC_BASE_ADDR						(IOPORT_BASE_ADDR+0x800)		//GPIOC base address
#define GPIOD_BASE_ADDR						(IOPORT_BASE_ADDR+0xC00)		//GPIOD base address

/*
 * NVIC base address
 */
#define NVIC_ISER							((uint32_t*)(0xE000E100))		//  NVIC base address

/*
 * Peripheral structure definitions
 */
typedef struct{
	__IO uint32_t MODER;					/*GPIO port mode register  				Address offset 0x0 */
	__IO uint32_t OTYPER;					/*GPIO port output type register  		Address offset 0x04*/
	__IO uint32_t OSPEEDR;					/*GPIO port output speed register  		Address offset 0x08*/
	__IO uint32_t PUPDR;					/*GPIO port pull-up/pull-down register 	Address offset 0x0C*/
	__IO uint32_t IDR;						/*GPIO port input data register		  	Address offset 0x10*/
	__IO uint32_t ODR;						/*GPIO port output data register  		Address offset 0x14*/
	__IO uint32_t BSRR;						/*GPIO port bit set/reset register  	Address offset 0x18*/
	__IO uint32_t LCKR;						/*GPIO port configuration lock register Address offset 0x1C*/
	__IO uint32_t AFR[2];					/*GPIO alternate functio register	    Address offset 0x20*/
	__IO uint32_t BRR;						/* GPIO port bit reset register 	 	Address offset 0x28*/
}GPIO_TypeDef_t;

#define GPIOA								((GPIO_TypeDef_t*)(GPIOA_BASE_ADDR))
#define GPIOB								((GPIO_TypeDef_t*)(GPIOB_BASE_ADDR))
#define GPIOC								((GPIO_TypeDef_t*)(GPIOC_BASE_ADDR))
#define GPIOD								((GPIO_TypeDef_t*)(GPIOD_BASE_ADDR))




typedef struct{
	__IO uint32_t RCC_CR;					/*Clock control register (RCC_CR)   	        		 	 Address offset 0x0*/
	__IO uint32_t RCC_ICSCR;				/*Internal clock sources calibration register 	 			 Address offset 0x4*/
	__IO uint32_t RCC_CRRCR;				/*Clock recovery RC register					 			 Address offset 0x8*/
	__IO uint32_t RCC_CFGR;					/*Clock configuration register					 			 Address offset 0xC*/
	__IO uint32_t RCC_CIER;					/*Clock interrupt enable register				 			 Address offset 0x10*/
	__IO uint32_t RCC_CIFR;					/*Clock interrupt flag register				    			 Address offset 0x14*/
	__IO uint32_t RCC_CICR;					/*Clock interrupt clear register							 Address offset 0x18*/
	__IO uint32_t RCC_IOPRSTR;				/*GPIO reset register				 			 			 Address offset 0x1C*/
	__IO uint32_t RCC_AHBRSTR;				/*AHB peripheral reset register  				 			 Address offset 0x20*/
	__IO uint32_t RCC_APB2RSTR;				/*APB2 peripheral reset register							 Address offset 0x24*/
	__IO uint32_t RCC_APB1RSTR;				/*APB1 peripheral reset register							 Address offset 0x28*/
	__IO uint32_t RCC_IOPENR;				/*GPIO clock enable register     							 Address offset 0x2C*/
	__IO uint32_t RCC_AHBENR;				/*AHB peripheral clock enable register			 			 Address offset 0x30*/
	__IO uint32_t RCC_APB2ENR;				/*APB2 peripheral clock enable register			 			 Address offset 0x34*/
	__IO uint32_t RCC_APB1ENR;				/*APB1 peripheral clock enable register			 			 Address offset 0x38*/
	__IO uint32_t RCC_IOPSMEN;				/*GPIO clock enable in Sleep mode register		 			 Address offset 0x3C*/
	__IO uint32_t RCC_AHBSMENR;				/*AHB peripheral clock enable in Sleep mode register  		 Address offset 0x40*/
	__IO uint32_t RCC_APB2SMENR;			/*APB2 peripheral clock enable in Sleep mode registerr		 Address offset 0x44*/
	__IO uint32_t RCC_APB1SMENR;			/*APB1 peripheral clock enable in Sleep mode register		 Address offset 0x48*/
	__IO uint32_t RCC_CCIPR;				/*Clock configuration register								 Address offset 0x4C*/
	__IO uint32_t RCC_CSR;					/*Control/status register				 					 Address offset 0x50*/
}RCC_Typedef_t;
#define RCC									((RCC_Typedef_t*)(RCC_BASE_ADDR))

