alerntrk/Drivers_STM32L053R8-/Inc/stm32l053Rx.h
typedef struct {
	__IO uint32_t SYSCFG_CFGR1;				/*SYSCFG memory remap register				 					 Address offset 0x0*/
	__IO uint32_t SYSCFG_CFGR2;				/*SYSCFG peripheral mode configuration register				 	 Address offset 0x4*/
	__IO uint32_t SYSCFG_EXTICR[4];			/*SYSCFG external interrupt configuration register			 	 Address offset 0x8*/
	__IO uint32_t COMP_CTRL[2];				/*Comparator 1 control and status register			 	 		 Address offset 0x18*/
	__IO uint32_t SYSCFG_CFGR3;				/*Reference control and status register			 		 		 Address offset 0x20*/

}SYSCFG_Typedef_t;

typedef struct{

	__IO uint32_t IMR;    					/*EXTI interrupt mask register				 					 Address offset 0x0*/
	__IO uint32_t EMR;						/*EXTI event mask register					 					 Address offset 0x4*/
	__IO uint32_t RTSR;						/*EXTI rising edge trigger selection register				 	 Address offset 0x8*/
	__IO uint32_t FTSR;						/*EXTI falling edge trigger selection register				 	 Address offset 0xC*/
	__IO uint32_t SWIER;					/*EXTI software interrupt event register			 			 Address offset 0x10*/
	__IO uint32_t PR;						/*EXTI pending register					 					     Address offset 0x14*/

}EXTI_Typedef_t;
#define EXTI								((EXTI_Typedef_t*)(EXTI_BASE_ADDR))
#define SYSCFG								((SYSCFG_Typedef_t*)(SYSCFG_BASE_ADDR))

typedef struct {

	__IO uint32_t SPI_CR1;					/*SPI control register 1 				 					 Address offset 0x00*/
	__IO uint32_t SPI_CR2;					/*SPI control register 2 				 					 Address offset 0x04*/
	__IO uint32_t SPI_SR;					/*SPI status register 				 						 Address offset 0x08*/
	__IO uint32_t SPI_DR;					/*SPI data register 				 						 Address offset 0x0C*/
	__IO uint32_t SPI_CRCPR;				/*SPI CRC polynomial register				 				 Address offset 0x10*/
	__IO uint32_t SPI_RXCRCR;				/*SPI RX CRC register				 				         Address offset 0x14*/
	__IO uint32_t SPI_TXCRCR;				/*SPI TX CRC register				 				         Address offset 0x18*/
	__IO uint32_t SPI_I2SCFGR;				/*SPI_I2S configuration register                             Address offset 0x1C*/
	__IO uint32_t SPI_I2SPR;				/*SPI_I2S prescaler register                                 Address offset 0x20*/

}SPI_Typedef_t;

#define SPI1								((SPI_Typedef_t*)(SPI1_BASE_ADDR))
#define SPI2								((SPI_Typedef_t*)(SPI2_BASE_ADDR))


typedef struct {
	__IO uint32_t UART_CR1;					/*Control register 1 				 					 Address offset 0x00*/
	__IO uint32_t UART_CR2;					/*Control register 2 				 					 Address offset 0x04*/
	__IO uint32_t UART_CR3;					/*Control register 3 				 					 Address offset 0x08*/
	__IO uint32_t UART_BRR;					/*Baud rate register				 					 Address offset 0x0C*/
	__IO uint32_t USART_GTPR;				/*Guard time and prescaler register				 		 Address offset 0x10*/
	__IO uint32_t USART_RTOR;				/*Receiver timeout register				 				 Address offset 0x14*/
	__IO uint32_t UART_RQR;				/*Request register				 				         Address offset 0x18*/
	__IO uint32_t UART_ISR;				/*Interrupt and status register                          Address offset 0x1C*/
	__IO uint32_t UART_ICR;				/*Interrupt flag clear register                          Address offset 0x20*/
	__IO uint32_t UART_RDR;				/*Receive data register                                  Address offset 0x24*/
	__IO uint32_t UART_TDR;				/*Transmit data register                                 Address offset 0x28*/

}UART_Typedef_t;
#define LPUART									((UART_Typedef_t*)(LPUART_BASE_ADDR))
#define USART1									((UART_Typedef_t*)(USART1_BASE_ADDR))
#define USART2									((UART_Typedef_t*)(USART2_BASE_ADDR))
#define USART4									((UART_Typedef_t*)(USART4_BASE_ADDR))


typedef struct {
	__IO uint32_t I2C_CR1;					/*Control register 1 				 					 Address offset 0x00*/
	__IO uint32_t I2C_CR2;					/*Control register 2 				 					 Address offset 0x04*/
	__IO uint32_t I2C_OAR1;					/*Own address 1 register				 				 Address offset 0x08*/
	__IO uint32_t I2C_OAR2;					/*Own address 2 register				 				 Address offset 0x0C*/
	__IO uint32_t I2C_TIMINGR;				/*Timing register							 		 	 Address offset 0x10*/
	__IO uint32_t I2C_TIMOUTR;				/*Timeout register			 				 			 Address offset 0x14*/
	__IO uint32_t I2C_ISR;					/*Interrupt and status register				 		     Address offset 0x18*/
	__IO uint32_t I2C_ICR;					/*Interrupt clear register 	                             Address offset 0x1C*/
	__IO uint32_t I2C_PECR;					/*PEC register			                         		 Address offset 0x20*/
	__IO uint32_t I2C_RXDR;					/*Receive data register                                  Address offset 0x24*/
	__IO uint32_t I2C_TXDR;					/*Transmit data register                                 Address offset 0x28*/

}I2C_Typedef_t;

#define I2C1							((I2C_Typedef_t*)(I2C1_BASE_ADDR))
#define I2C2							((I2C_Typedef_t*)(I2C2_BASE_ADDR))


/* BIT Definitions*/
#define RCC_IOPENR_IOPAEN_POS				(0x0U)													/*RCC IOPENR register IOPAEN bit position	*/
#define RCC_IOPENR_IOPAEN_MSK				(0x1 << RCC_IOPENR_IOPAEN_POS)							/*RCC IOPENR register IOPAEN bit mask		*/
#define RCC_IOPENR_IOPAEN				    (RCC_IOPENR_IOPAEN_MSK)									/*RCC IOPENR register IOPAEN macro			*/

#define RCC_IOPENR_IOPBEN_POS				(0x1U)													/*RCC IOPENR register IOPBEN bit position	*/
#define RCC_IOPENR_IOPBEN_MSK				(0x1 << RCC_IOPENR_IOPBEN_POS)							/*RCC IOPENR register IOPBEN bit mask		*/
#define RCC_IOPENR_IOPBEN				    (RCC_IOPENR_IOPBEN_MSK)									/*RCC IOPENR register IOPBEN macro			*/


#define RCC_IOPENR_IOPCEN_POS				(0x2U)													/*RCC IOPENR register IOPCEN bit position	*/
#define RCC_IOPENR_IOPCEN_MSK				(0x1 << RCC_IOPENR_IOPCEN_POS)							/*RCC IOPENR register IOPCEN bit mask		*/
#define RCC_IOPENR_IOPCEN				    (RCC_IOPENR_IOPCEN_MSK)									/*RCC IOPENR register IOPCEN macro          */

#define RCC_IOPENR_IOPDEN_POS				(0x3U)													/*RCC IOPENR register IOPDEN bit position   */
#define RCC_IOPENR_IOPDEN_MSK				(0x1 << RCC_IOPENR_IOPDEN_POS)							/*RCC IOPENR register IOPDEN bit mask       */
#define RCC_IOPENR_IOPDEN				    (RCC_IOPENR_IOPDEN_MSK)									/*RCC IOPENR register IOPDEN macro          */

#define RCC_APB2ENR_SYSCFG_Pos 				(0x0)													/*RCC APB2ENR register SYSCFG bit position */
#define RCC_APB2ENR_SYSCFG_Msk				(0x1 << RCC_APB2ENR_SYSCFG_Pos)							/*RCC APB2ENR register SYSCFG bit mask	   */
#define RCC_APB2ENR_SYSCFG					RCC_APB2ENR_SYSCFG_Msk									/*RCC APB2ENR register SYSCFG macro		   */

#define RCC_APB2ENR_SPI1_Pos				(0xC)													/*RCC APB2ENR register SPI1 bit position*/
#define RCC_APB2ENR_SPI1_Msk				(0x1 << RCC_APB2ENR_SPI1_Pos)							/*RCC APB2ENR register SPI1 bit Mask    */
#define RCC_APB2ENR_SPI1				    RCC_APB2ENR_SPI1_Msk									/*RCC APB2ENR register SPI1 bit Macro   */


#define RCC_APB1ENR_SPI2_Pos				(0xE)													/*RCC APB1ENR register SPI2 bit position*/
#define RCC_APB1ENR_SPI2_Msk				(0x1 << RCC_APB1ENR_SPI2_Pos)							/*RCC APB1ENR register SPI2 bit Mask    */
#define RCC_APB1ENR_SPI2				    RCC_APB1ENR_SPI2_Msk									/*RCC APB1ENR register SPI2 bit Macro   */

#define RCC_APB1ENR_USART2_Pos				(17U)													/*RCC APB1ENR register USART2 bit position*/
#define RCC_APB1ENR_USART2_Msk				(0x1 << RCC_APB1ENR_USART2_Pos)							/*RCC APB1ENR register USART2 bit Mask    */
#define RCC_APB1ENR_USART2				    RCC_APB1ENR_USART2_Msk									/*RCC APB1ENR register USART2 bit Macro   */

